app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index
        #byebug
        @students = Student.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        #byebug
        @student = Student.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Yak"], ["last_name", "Son"], ["created_at", "2020-09-20 19:30:36.340231"], ["updated_at", "2020-09-20 19:30:36.340231"]]
---
    def create
        @student = Student.new(params.require(:student).permit(:first_name, :last_name))
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "blockdf"], ["updated_at", "2020-09-20 20:37:33.605106"], ["id", 6]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(params.require(:student).permit(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "students".* FROM "students"
---
    def edit
        @student = Student.find(params[:id])
        @students = Student.all